
---

# 14.4.1: Two Methods for Modifying an ACL

#### The Need for Modification
ACLs often require adjustments after initial configuration because they can be complex and may not produce the expected results immediately. Achieving the desired filtering often involves some trial and error.

#### Two Primary Modification Methods

1.  **Using a Text Editor:** The traditional method for making significant changes, especially to older-style numbered ACLs.
2.  **Using Sequence Numbers:** The modern and preferred method for editing named ACLs, allowing for the insertion and deletion of individual rules.


---

# 14.4.2: Modifying ACLs with a Text Editor

#### Core Concept
This method is a "delete and replace" strategy, primarily used for **numbered ACLs** which cannot be edited line-by-line. It's also useful for making significant changes to any ACL offline.

#### The Workflow
1.  **Copy the ACL:** Use `show running-config | section access-list` to display the current ACL, then copy and paste it into a text editor (e.g., Notepad).

2.  **Edit in the Text Editor:** Make all necessary corrections, additions, or re-ordering of rules in the text file.

3.  **Delete the Old ACL (CRITICAL STEP):** You **must** completely remove the old ACL from the router.
    *   **Command:** `no access-list [number]`
    *   **Why it's critical:** If you skip this step, pasting the new rules will just **append** them to the end of the existing (incorrect) ACL, not replace it.

4.  **Paste the Corrected ACL:** Copy the final, correct commands from your text editor and paste them into the router's global configuration mode.

#### Example Scenario
*   **Mistake:** `access-list 1 deny 19.168.10.10` was configured instead of `192.168.10.10`.
*   **Fix:**
    1.  Copy the full `access-list 1` into Notepad.
    2.  Correct `19.` to `192.` in the file.
    3.  On the router, run `no access-list 1`.
    4.  Paste the corrected `access-list 1` commands back into the router.


---

# 14.4.3: Modifying ACLs with Sequence Numbers

#### Core Concept
This is the modern and preferred method for editing ACLs. It allows for the insertion and deletion of individual Access Control Entries (ACEs) without having to delete the entire ACL. This method works for both **named** and **numbered** ACLs.

#### Key Points
*   **Automatic Numbering:** Each ACE is automatically assigned a sequence number (e.g., 10, 20, 30...).
*   **Viewing Sequence Numbers:** To see the sequence numbers, you **must** use the `show access-lists` command. They are **not** visible in the `show running-config` output.
*   **Editing Logic:** You cannot directly overwrite an existing line. You must first **delete** the incorrect line and then **add** the corrected one.

---

#### Workflow for Editing
1.  **Identify the Line to Change:**
    Use `show access-lists` to find the sequence number of the incorrect ACE.
    ```
    R1# show access-lists
    Standard IP access list 1
       10 deny 19.168.10.10  <-- Incorrect line
       20 permit 192.168.10.0 ...
    ```

2.  **Enter ACL Configuration Mode:**
    Use the `ip access-list` command to enter the specific ACL's sub-configuration mode.
    ```
    R1(config)# ip access-list standard 1
    ```

3.  **Delete the Incorrect ACE:**
    Use `no` followed by the sequence number.
    ```
    R1(config-std-nacl)# no 10
    ```

4.  **Add the Correct ACE:**
    Specify the sequence number you want to use (you can re-use the old one or pick a new one) followed by the correct rule.
    ```
    R1(config-std-nacl)# 10 deny host 192.168.10.10
    ```

5.  **Verify:**
    Use `show access-lists` again to confirm the change was successful.