
***

### **Lab: Configure Numbered Standard IPv4 ACLs**

#### **Objective:**
To configure, apply, and verify numbered standard ACLs to filter traffic based on source IP addresses according to specific network policies.

---

#### **Policy & Configuration on R2**

*   **Policy:** Deny the `192.168.11.0/24` network from accessing the WebServer network (`192.168.20.0/24`). Permit all other traffic.
*   **Placement:** Outbound on the `GigabitEthernet0/0` interface.

**1. Create ACL 1 on R2:**

```bash
R2(config)# access-list 1 deny   192.168.11.0 0.0.0.255
R2(config)# access-list 1 permit any
```

**2. Apply ACL 1 on R2:**

```bash
R2(config)# interface GigabitEthernet0/0
R2(config-if)# ip access-group 1 out
```

---

#### **Policy & Configuration on R3**

*   **Policy:** Deny the PC1 network (`192.168.10.0/24`) from accessing the PC3 network (`192.168.30.0/24`). Permit all other traffic.
*   **Placement:** Outbound on the `GigabitEthernet0/0` interface.

**1. Create ACL 1 on R3:**

```bash
R3(config)# access-list 1 deny   192.168.10.0 0.0.0.255
R3(config)# access-list 1 permit any
```

**2. Apply ACL 1 on R3:**

```bash
R3(config)# interface GigabitEthernet0/0
R3(config-if)# ip access-group 1 out
```

---

#### **Verification**

**1. Verification Commands:**
*   **Check ACL rules and match counts:**

    ```bash
    show access-lists
    ```
*   **Verify ACL is applied to the correct interface:**

    ```bash
    show ip interface gigabitethernet 0/0
    ```
    OR
    ```bash
    show running-config
    ```

**2. Test ACL Functionality (Ping Results):**

*   `192.168.10.10` → `192.168.11.10`: **Succeeds**
*   `192.168.10.10` → `192.168.20.254`: **Succeeds**
*   `192.168.11.10` → `192.168.20.254`: **Fails** (Blocked by R2 ACL)
*   `192.168.10.10` → `192.168.30.10`: **Fails** (Blocked by R3 ACL)
*   `192.168.11.10` → `192.168.30.10`: **Succeeds**
*   `192.168.30.10` → `192.168.20.254`: **Succeeds**