
***

### **Lab: Configure Named Standard IPv4 ACLs**

#### **Objective:**
Create a named standard ACL to control access to a File Server. Only the Web Manager (PC1) and the Web Server are allowed access; all other traffic is denied.

---

#### **Part 1: Configuration & Application**

**1. Create the Named Standard ACL on R1:**
*   The ACL is named `File_Server_Restrictions`.
*   It permits PC1 (`192.168.20.4`) and the Web Server (`192.168.100.100`).
*   It denies all other traffic.

```bash
R1(config)# ip access-list standard File_Server_Restrictions
R1(config-std-nacl)# permit host 192.168.20.4
R1(config-std-nacl)# permit host 192.168.100.100
R1(config-std-nacl)# deny any
```

**2. Apply the ACL to the Interface:**
*   Apply the ACL to the `FastEthernet 0/1` interface in the **outbound** direction (towards the servers).

```bash
R1(config)# interface FastEthernet0/1
R1(config-if)# ip access-group File_Server_Restrictions out
```

---

#### **Part 2: Verification**

**1. Verify ACL Configuration & Application:**
*   **Check the ACL rules:**

    ```bash
    R1# show access-lists
    ```
*   **Verify ACL is applied to the interface:**

    ```bash
    R1# show ip interface fastethernet 0/1
    ```
    *(Look for the "Outgoing access list is File_Server_Restrictions" line)*

    OR

    ```bash
    R1# show running-config
    ```

**2. Test ACL Functionality:**
*   **Successful Pings:**
    *   PC1 → File Server (`192.168.100.10`)
    *   Web Server → File Server (`192.168.100.10`)
    *   All PCs → Web Server (`192.168.100.100`)
*   **Failed Pings (Denied by ACL):**
    *   PC2 → File Server (`192.168.100.10`)
    *   PC3 → File Server (`192.168.100.10`)

*   **Check ACL Match Counts:**
    *   Use `show access-lists` again to see which rules are matching packets.

    ```bash
    R1# show access-lists
    ```