Of course. Here are the concise notes and commands for your "Configure Extended ACLs Scenario 2" lab, formatted for your Obsidian review.

***

### **Lab: Configure Extended ACLs - Scenario 2**

#### **Objective:**
Configure a single named extended ACL on `RT1` to enforce a multi-part security policy, filtering traffic from specific PCs to servers on the internet.

#### **Security Policy:**
1.  **PC1 (`172.31.1.101`):** Deny HTTP & HTTPS access to Server1 & Server2.
2.  **PC2 (`172.31.1.102`):** Deny FTP access to Server1 & Server2.
3.  **PC3 (`172.31.1.103`):** Deny ICMP (ping) access to Server1 & Server2.
4.  All other traffic from any source to any destination is permitted.

---

#### **Part 1: ACL Configuration on RT1**

**1. Create the Named Extended ACL `ACL`:**

```bash
RT1(config)# ip access-list extended ACL
```

**2. Add `deny` Statements for PC1 (HTTP/HTTPS):**

```bash
RT1(config-ext-nacl)# deny tcp host 172.31.1.101 host 64.101.255.254 eq www
RT1(config-ext-nacl)# deny tcp host 172.31.1.101 host 64.101.255.254 eq 443
RT1(config-ext-nacl)# deny tcp host 172.31.1.101 host 64.103.255.254 eq www
RT1(config-ext-nacl)# deny tcp host 172.31.1.101 host 64.103.255.254 eq 443
```

**3. Add `deny` Statements for PC2 (FTP):**

```bash
RT1(config-ext-nacl)# deny tcp host 172.31.1.102 host 64.101.255.254 eq ftp
RT1(config-ext-nacl)# deny tcp host 172.31.1.102 host 64.103.255.254 eq ftp
```

**4. Add `deny` Statements for PC3 (ICMP):**

```bash
RT1(config-ext-nacl)# deny icmp host 172.31.1.103 host 64.101.255.254
RT1(config-ext-nacl)# deny icmp host 172.31.1.103 host 64.103.255.254
```

**5. Permit All Other Traffic:**
*This is a critical final step. Without it, all traffic not explicitly denied would be blocked.*
```bash
RT1(config-ext-nacl)# permit ip any any
```

---

#### **Part 2: Application and Verification**

**1. Apply the ACL to the LAN Interface:**
*   Place the ACL on the interface closest to the source traffic.
*   The source traffic is the LAN (`172.31.1.96/27`). Apply the ACL **inbound** on that interface (e.g., `GigabitEthernet0/0`).

```bash
RT1(config)# interface GigabitEthernet0/0
RT1(config-if)# ip access-group ACL in
```

**2. Verification Commands:**
*   **View ACLs and match counts:**

    ```bash
    RT1# show access-lists
    ```
*   **Reset ACL counters for clean testing:**

    ```bash
    RT1# clear access-list counters
    ```

**3. Test Results Summary:**

*   **PC1 (`172.31.1.101`):**
    *   Web Browser (HTTP/HTTPS) to Server1/Server2: **FAILS**
    *   FTP to Server1/Server2: **SUCCEEDS**
    *   Ping Server1/Server2: **SUCCEEDS**

*   **PC2 (`172.31.1.102`):**
    *   Web Browser (HTTP/HTTPS) to Server1/Server2: **SUCCEEDS**
    *   FTP to Server1/Server2: **FAILS**
    *   Ping Server1/Server2: **SUCCEEDS**

*   **PC3 (`172.31.1.103`):**
    *   Web Browser (HTTP/HTTPS) to Server1/Server2: **SUCCEEDS**
    *   FTP to Server1/Server2: **SUCCEEDS**
    *   Ping Server1/Server2: **FAILS**