
***

### **Lab: Configure Extended ACLs - Scenario 1**

#### **Objective:**
To configure two extended ACLs on R1. The first (numbered) allows PC1's LAN FTP and ICMP access to the server. The second (named) allows PC2's LAN HTTP and ICMP access to the same server. All other traffic is implicitly denied.

---

#### **Part 1: Numbered ACL for PC1 LAN (FTP & ICMP)**

*   **Policy:** Permit traffic from PC1's network (`172.22.34.64/27`) to the Server (`172.22.34.62`) only for FTP (TCP port 21) and ICMP (ping).
*   **Placement:** Inbound on the `GigabitEthernet0/0` interface.

**1. Create Numbered ACL 100:**
*   The wildcard mask for `/27` is `0.0.0.31`.

```bash
R1(config)# access-list 100 permit tcp 172.22.34.64 0.0.0.31 host 172.22.34.62 eq ftp
R1(config)# access-list 100 permit icmp 172.22.34.64 0.0.0.31 host 172.22.34.62
```

**2. Apply ACL 100:**

```bash
R1(config)# interface gigabitEthernet 0/0
R1(config-if)# ip access-group 100 in
```

**3. Verification for Part 1:**
*   Ping PC1 → Server (`172.22.34.62`): **Succeeds**
*   FTP PC1 → Server (`172.22.34.62`): **Succeeds**
*   Ping PC1 → PC2: **Fails** (Implicitly denied)

---

#### **Part 2: Named ACL for PC2 LAN (HTTP & ICMP)**

*   **Policy:** Permit traffic from PC2's network (`172.22.34.96/28`) to the Server (`172.22.34.62`) only for HTTP (TCP port 80/www) and ICMP (ping).
*   **Placement:** Inbound on the `GigabitEthernet0/1` interface.

**1. Create Named ACL `HTTP_ONLY`:**
*   The wildcard mask for `/28` is `0.0.0.15`.

```bash
R1(config)# ip access-list extended HTTP_ONLY
R1(config-ext-nacl)# permit tcp 172.22.34.96 0.0.0.15 host 172.22.34.62 eq www
R1(config-ext-nacl)# permit icmp 172.22.34.96 0.0.0.15 host 172.22.34.62
```

**2. Apply ACL `HTTP_ONLY`:**

```bash
R1(config)# interface gigabitEthernet 0/1
R1(config-if)# ip access-group HTTP_ONLY in
```

**3. Verification for Part 2:**
*   Ping PC2 → Server (`172.22.34.62`): **Succeeds**
*   Web Browser PC2 → Server (`172.22.34.62`): **Succeeds**
*   FTP PC2 → Server (`172.22.34.62`): **Fails** (Denied by ACL)

---

#### **General Verification Commands**

*   **View all configured ACLs and match counts on R1:**
    ```bash
    R1# show access-lists
    ```
*   **Verify ACL application on interfaces:**
    ```bash
    R1# show ip interface gigabitEthernet 0/0
    R1# show ip interface gigabitEthernet 0/1
    ```