
***

### **Lab: ACL Configuration for Network Security**

#### **Objective:**
Implement a series of standard and extended ACLs across three routers (R1, R2, R3) to secure the network, control access to services, and mitigate common threats like IP address spoofing.

---

### **Task 1: Secure VTY Lines (Remote Access) on R1, R2, & R3**

*   **Goal:** Allow SSH access exclusively from the management station PC-C (`192.168.3.3`). Block all other remote access attempts.
*   **Method:** Apply a standard access list to the VTY (virtual terminal) lines on all three routers.

**Configuration (Apply on R1, R2, and R3):**

```bash
# 1. Create a named standard ACL to permit only PC-C
R1(config)# ip access-list standard VTY_ACCESS
R1(config-std-nacl)# permit host 192.168.3.3
R1(config-std-nacl)# exit

# 2. Apply the ACL to the VTY lines
R1(config)# line vty 0 4
R1(config-line)# access-class VTY_ACCESS in
R1(config-line)# transport input ssh
```
*Note: The `deny any` is implicit at the end of the ACL.*

---

### **Task 2: Configure Inbound ACL on R1 (from Internet)**

*   **Goal:** Filter traffic coming from the internet (via R2) towards the internal server PC-A.
*   **Policy:**
    *   Permit DNS, SMTP, and FTP to server PC-A (`192.168.1.3`).
    *   Deny HTTPS to server PC-A.
    *   Permit PC-C to SSH to R1's external interface (`10.1.1.1`).
*   **Placement:** Apply an extended ACL inbound on the `Serial0/0/0` interface.

**Configuration (On R1):**

```bash
# 1. Create a named extended ACL
R1(config)# ip access-list extended OUTSIDE_IN

# 2. Permit specific services to PC-A
R1(config-ext-nacl)# permit tcp any host 192.168.1.3 eq 25
R1(config-ext-nacl)# permit tcp any host 192.168.1.3 eq 21
R1(config-ext-nacl)# permit udp any host 192.168.1.3 eq 53
R1(config-ext-nacl)# permit tcp any host 192.168.1.3 eq 53

# 3. Deny HTTPS to PC-A
R1(config-ext-nacl)# deny tcp any host 192.168.1.3 eq 443

# 4. Permit management access from PC-C
R1(config-ext-nacl)# permit tcp host 192.168.3.3 host 10.1.1.1 eq 22
R1(config-ext-nacl)# exit

# 5. Apply the ACL to the external interface
R1(config)# interface Serial0/0/0
R1(config-if)# ip access-group OUTSIDE_IN in
```

---

### **Task 3: Modify R1 ACL to Allow ICMP & Other Traffic**

*   **Goal:** Modify the `OUTSIDE_IN` ACL to be less restrictive.
*   **Policy:**
    *   Permit ICMP echo-replies (to allow pings *from* the internal network).
    *   Permit ICMP destination-unreachable messages.
    *   Deny all other ICMP types.
    *   Permit all other traffic.
*   **Method:** Use sequence numbers to insert lines into the existing named ACL.

**Configuration (On R1):**

```bash
# 1. Enter the named ACL configuration mode
R1(config)# ip access-list extended OUTSIDE_IN

# 2. Insert new rules using sequence numbers (e.g., 65, 70, 80, 90)
R1(config-ext-nacl)# 65 permit icmp any any echo-reply
R1(config-ext-nacl)# 70 permit icmp any any unreachable
R1(config-ext-nacl)# 80 deny icmp any any
R1(config-ext-nacl)# 90 permit ip any any
```
*Verification: PC-A can now successfully ping R2's loopback interface.*

---

### **Task 4: Configure Ingress Filtering on R3 LAN**

*   **Goal:** Prevent IP address spoofing from the internal LAN. Only allow traffic sourced from the `192.168.3.0/24` network.
*   **Placement:** Apply a standard ACL inbound on the `GigabitEthernet0/1` interface.

**Configuration (On R3):**

```bash
# 1. Create an ACL to permit only the local LAN subnet
R3(config)# ip access-list standard LAN_IN
R3(config-std-nacl)# permit 192.168.3.0 0.0.0.255
R3(config-std-nacl)# exit

# 2. Apply the ACL to the LAN interface
R3(config)# interface GigabitEthernet0/1
R3(config-if)# ip access-group LAN_IN in
```

---

### **Task 5: Configure Anti-Spoofing on R3 WAN**

*   **Goal:** Block inbound traffic on the WAN interface that is spoofed to look like it came from a private (RFC 1918) network.
*   **Policy:**
    *   Permit SSH traffic from `10.0.0.0/8` returning to PC-C.
    *   Deny all traffic sourced from `10.0.0.0/8`, `172.16.0.0/12`, and `192.168.0.0/16`.
    *   Permit everything else.
*   **Placement:** Apply an extended ACL inbound on the `Serial0/0/1` interface.

**Configuration (On R3):**

```bash
# 1. Create the named extended ACL
R3(config)# ip access-list extended ANTI_SPOOF

# 2. Permit return SSH traffic to the management PC
R3(config-ext-nacl)# permit tcp 10.0.0.0 0.255.255.255 host 192.168.3.3 eq 22

# 3. Deny the private RFC 1918 address ranges
R3(config-ext-nacl)# deny ip 10.0.0.0 0.255.255.255 any
R3(config-ext-nacl)# deny ip 172.16.0.0 0.15.255.255 any
R3(config-ext-nacl)# deny ip 192.168.0.0 0.0.255.255 any

# 4. Permit all other legitimate traffic
R3(config-ext-nacl)# permit ip any any
R3(config-ext-nacl)# exit

# 5. Apply the ACL to the WAN interface
R3(config)# interface Serial0/0/1
R3(config-if)# ip access-group ANTI_SPOOF in
```